In [1443]:
#importing pandas and numpy

import pandas as pd
import numpy as np

# Sales Data

In [1444]:
# imporing sales data
sales_df = pd.read_csv("sales_raw.csv",sep="|")

sales_df.head(10)

,transaction_id,customer_id,product_id,quantity,unit_price,transaction_date,status
0,T001,C001,P001,1,45999.0,2024-01-15,Completed
1,T002,C002,P004,2,2999.0,2024-01-16,Completed
2,T003,C003,P007,1,52999.0,15/01/2024,Completed
3,T004,NaN,P002,1,3499.0,2024-01-18,Pending
4,T005,C005,P009,3,650.0,2024-01-20,Completed
5,T006,C006,P012,1,12999.0,01-22-2024,Completed
6,T007,C007,P005,2,1999.0,2024-01-23,Completed
7,T008,C008,NaN,1,1299.0,2024-01-25,Completed
8,T009,C009,P011,1,4599.0,2024-01-28,Cancelled
9,T010,C010,P006,5,899.0,2024-02-01,Completed

In [1445]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41 entries, 0 to 40
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    41 non-null     object
 1   customer_id       38 non-null     object
 2   product_id        39 non-null     object
 3   quantity          41 non-null     int64
 4   unit_price        41 non-null     float64
 5   transaction_date  41 non-null     object
 6   status            41 non-null     object
dtypes: float64(1), int64(1), object(5)
memory usage: 2.4+ KB

In [1446]:
sales_df.shape

(41, 7)

In [1447]:
Sales_df_n=sales_df

#dropping blank values
Sales_df_n.dropna(inplace=True)
Sales_df_n.count()

transaction_id      36
customer_id         36
product_id          36
quantity            36
unit_price          36
transaction_date    36
status              36
dtype: int64

In [1448]:
# Correcting dates

# Extract date, year, and month into new columns
Sales_df_n[['Col1', 'Col2', 'Col3']] = Sales_df_n['transaction_date'].str.split(r'[-/]', expand=True)
Sales_df_n.head(2)


Sales_df_n["regn_date"] = Sales_df_n[["Col1","Col2","Col3"]].agg("-".join,axis=1)

Sales_df_n.head(5)

# Ensure numeric comparison works even if Col1/Col3 are strings
Sales_df_n['Col1'] = pd.to_numeric(Sales_df_n['Col1'], errors='coerce')
Sales_df_n['Col2'] = pd.to_numeric(Sales_df_n['Col2'], errors='coerce')
Sales_df_n['Col3'] = pd.to_numeric(Sales_df_n['Col3'], errors='coerce')

# Col4: if Col1 > 1900, take Col1; else take Col3
Sales_df_n['year'] = np.where(Sales_df_n['Col1'] > 1900, Sales_df_n['Col1'], Sales_df_n['Col3'])

Sales_df_n['month'] = np.where(Sales_df_n['Col2'] < 13, Sales_df_n['Col2'], Sales_df_n['Col3'])

Sales_df_n['month'] = np.where(Sales_df_n['month'] > 12, Sales_df_n['Col1'], Sales_df_n['month'])

Sales_df_n['day'] = np.where(Sales_df_n['Col3'] < 1900, Sales_df_n['Col3'], 1900)

Sales_df_n['day1'] = np.where(
    (Sales_df_n['day'] == 1900) & (Sales_df_n['Col1'] > 12),
    Sales_df_n['Col1'],
    Sales_df_n['Col2']
)

Sales_df_n['Day3'] = np.where(Sales_df_n['day'] ==1900, Sales_df_n['day1'], Sales_df_n['day'])

Sales_df_n.head(10)

#Concatnating year date and month coumn to form correct Regn_date column

#Sales_df_n['regn_date_1'] = Sales_df_n[['year', 'month', 'Day3']].astype(str).agg('-'.join, axis=1)

# Ensure values are clean and numeric
Sales_df_n['year'] = pd.to_numeric(Sales_df_n['year'], errors='coerce')
Sales_df_n['month'] = pd.to_numeric(Sales_df_n['month'], errors='coerce')
Sales_df_n['Day3'] = pd.to_numeric(Sales_df_n['Day3'], errors='coerce')

# Create a datetime column
Sales_df_n['txn_date_dt'] = pd.to_datetime(
    dict(year=Sales_df_n['year'], month=Sales_df_n['month'], day=Sales_df_n['Day3']),
    errors='coerce'  # invalid combos become NaT
)

Sales_df_n

,transaction_id,customer_id,product_id,quantity,unit_price,transaction_date,status,Col1,Col2,Col3,regn_date,year,month,day,day1,Day3,txn_date_dt
0,T001,C001,P001,1,45999.0,2024-01-15,Completed,2024,1,15,2024-01-15,2024,1,15,1,15,2024-01-15
1,T002,C002,P004,2,2999.0,2024-01-16,Completed,2024,1,16,2024-01-16,2024,1,16,1,16,2024-01-16
2,T003,C003,P007,1,52999.0,15/01/2024,Completed,15,1,2024,15-01-2024,2024,1,1900,15,15,2024-01-15
4,T005,C005,P009,3,650.0,2024-01-20,Completed,2024,1,20,2024-01-20,2024,1,20,1,20,2024-01-20
5,T006,C006,P012,1,12999.0,01-22-2024,Completed,1,22,2024,01-22-2024,2024,1,1900,22,22,2024-01-22
6,T007,C007,P005,2,1999.0,2024-01-23,Completed,2024,1,23,2024-01-23,2024,1,23,1,23,2024-01-23
8,T009,C009,P011,1,4599.0,2024-01-28,Cancelled,2024,1,28,2024-01-28,2024,1,28,1,28,2024-01-28
9,T010,C010,P006,5,899.0,2024-02-01,Completed,2024,2,1,2024-02-01,2024,2,1,2,1,2024-02-01
10,T001,C001,P001,1,45999.0,2024-01-15,Completed,2024,1,15,2024-01-15,2024,1,15,1,15,2024-01-15
11,T011,C011,P014,1,69999.0,02/02/2024,Completed,2,2,2024,02-02-2024,2024,2,1900,2,2,2024-02-02
12,T012,C012,P003,1,52999.0,2024-02-05,Completed,2024,2,5,2024-02-05,2024,2,5,2,5,2024-02-05
13,T013,C013,P015,3,450.0,2024-02-08,Completed,2024,2,8,2024-02-08,2024,2,8,2,8,2024-02-08
14,T014,C014,P019,2,1499.0,02-10-2024,Completed,2,10,2024,02-10-2024,2024,10,1900,10,10,2024-10-10
15,T015,C015,P008,3,1299.0,2024-02-12,Completed,2024,2,12,2024-02-12,2024,2,12,2,12,2024-02-12
17,T017,C017,P016,1,32999.0,2024-02-18,Completed,2024,2,18,2024-02-18,2024,2,18,2,18,2024-02-18
18,T018,C018,P020,2,1899.0,2024-02-20,Completed,2024,2,20,2024-02-20,2024,2,20,2,20,2024-02-20
19,T019,C019,P018,10,120.0,02/22/2024,Completed,2,22,2024,02-22-2024,2024,2,1900,22,22,2024-02-22
20,T020,C020,P010,1,45999.0,2024-02-25,Completed,2024,2,25,2024-02-25,2024,2,25,2,25,2024-02-25
21,T021,C021,P017,2,2999.0,2024-02-28,Completed,2024,2,28,2024-02-28,2024,2,28,2,28,2024-02-28
22,T022,C002,P001,1,45999.0,2024-03-01,Completed,2024,3,1,2024-03-01,2024,3,1,3,1,2024-03-01
23,T023,C003,P019,3,1499.0,03-02-2024,Completed,3,2,2024,03-02-2024,2024,2,1900,2,2,2024-02-02
24,T024,C004,P009,5,650.0,2024-03-05,Completed,2024,3,5,2024-03-05,2024,3,5,3,5,2024-03-05
26,T026,C006,P011,1,4599.0,2024-03-10,Completed,2024,3,10,2024-03-10,2024,3,10,3,10,2024-03-10
27,T027,C007,P002,2,3499.0,03/12/2024,Completed,3,12,2024,03-12-2024,2024,12,1900,12,12,2024-12-12
28,T028,C008,P015,4,450.0,2024-03-15,Completed,2024,3,15,2024-03-15,2024,3,15,3,15,2024-03-15
29,T029,C009,P007,1,52999.0,2024-03-18,Completed,2024,3,18,2024-03-18,2024,3,18,3,18,2024-03-18
31,T031,C011,P012,1,12999.0,03-22-2024,Completed,3,22,2024,03-22-2024,2024,3,1900,22,22,2024-03-22
32,T032,C012,P016,1,32999.0,2024-03-25,Completed,2024,3,25,2024-03-25,2024,3,25,3,25,2024-03-25
33,T033,C013,P005,2,1999.0,2024-03-28,Completed,2024,3,28,2024-03-28,2024,3,28,3,28,2024-03-28
34,T034,C014,P008,2,1299.0,2024-03-30,Completed,2024,3,30,2024-03-30,2024,3,30,3,30,2024-03-30
35,T035,C015,P018,8,120.0,04/01/2024,Completed,4,1,2024,04-01-2024,2024,1,1900,1,1,2024-01-01
36,T036,C016,P014,1,69999.0,2024-04-03,Completed,2024,4,3,2024-04-03,2024,4,3,4,3,2024-04-03
37,T037,C017,P006,4,899.0,2024-04-05,Completed,2024,4,5,2024-04-05,2024,4,5,4,5,2024-04-05
38,T038,C018,P020,1,1899.0,04-08-2024,Completed,4,8,2024,04-08-2024,2024,8,1900,8,8,2024-08-08
39,T039,C019,P019,2,1499.0,2024-04-10,Completed,2024,4,10,2024-04-10,2024,4,10,4,10,2024-04-10
40,T040,C020,P013,1,5499.0,2024-04-12,Completed,2024,4,12,2024-04-12,2024,4,12,4,12,2024-04-12

In [1449]:
#checkin duplicate transaction IDs
Sales_df_n["transaction_id"].duplicated().any()

np.True_

In [1450]:
Sales_df_n.head(1)

,transaction_id,customer_id,product_id,quantity,unit_price,transaction_date,status,Col1,Col2,Col3,regn_date,year,month,day,day1,Day3,txn_date_dt
0,T001,C001,P001,1,45999.0,2024-01-15,Completed,2024,1,15,2024-01-15,2024,1,15,1,15,2024-01-15

In [1451]:
# taking final column


Sales_df_n = Sales_df_n.drop(
    ["transaction_date", "Col1", "Col2", "Col3", "year", "month", "day", "day1", "Day3"],
    axis=1
)

In [1452]:
Sales_df_n

,transaction_id,customer_id,product_id,quantity,unit_price,status,regn_date,txn_date_dt
0,T001,C001,P001,1,45999.0,Completed,2024-01-15,2024-01-15
1,T002,C002,P004,2,2999.0,Completed,2024-01-16,2024-01-16
2,T003,C003,P007,1,52999.0,Completed,15-01-2024,2024-01-15
4,T005,C005,P009,3,650.0,Completed,2024-01-20,2024-01-20
5,T006,C006,P012,1,12999.0,Completed,01-22-2024,2024-01-22
6,T007,C007,P005,2,1999.0,Completed,2024-01-23,2024-01-23
8,T009,C009,P011,1,4599.0,Cancelled,2024-01-28,2024-01-28
9,T010,C010,P006,5,899.0,Completed,2024-02-01,2024-02-01
10,T001,C001,P001,1,45999.0,Completed,2024-01-15,2024-01-15
11,T011,C011,P014,1,69999.0,Completed,02-02-2024,2024-02-02
12,T012,C012,P003,1,52999.0,Completed,2024-02-05,2024-02-05
13,T013,C013,P015,3,450.0,Completed,2024-02-08,2024-02-08
14,T014,C014,P019,2,1499.0,Completed,02-10-2024,2024-10-10
15,T015,C015,P008,3,1299.0,Completed,2024-02-12,2024-02-12
17,T017,C017,P016,1,32999.0,Completed,2024-02-18,2024-02-18
18,T018,C018,P020,2,1899.0,Completed,2024-02-20,2024-02-20
19,T019,C019,P018,10,120.0,Completed,02-22-2024,2024-02-22
20,T020,C020,P010,1,45999.0,Completed,2024-02-25,2024-02-25
21,T021,C021,P017,2,2999.0,Completed,2024-02-28,2024-02-28
22,T022,C002,P001,1,45999.0,Completed,2024-03-01,2024-03-01
23,T023,C003,P019,3,1499.0,Completed,03-02-2024,2024-02-02
24,T024,C004,P009,5,650.0,Completed,2024-03-05,2024-03-05
26,T026,C006,P011,1,4599.0,Completed,2024-03-10,2024-03-10
27,T027,C007,P002,2,3499.0,Completed,03-12-2024,2024-12-12
28,T028,C008,P015,4,450.0,Completed,2024-03-15,2024-03-15
29,T029,C009,P007,1,52999.0,Completed,2024-03-18,2024-03-18
31,T031,C011,P012,1,12999.0,Completed,03-22-2024,2024-03-22
32,T032,C012,P016,1,32999.0,Completed,2024-03-25,2024-03-25
33,T033,C013,P005,2,1999.0,Completed,2024-03-28,2024-03-28
34,T034,C014,P008,2,1299.0,Completed,2024-03-30,2024-03-30
35,T035,C015,P018,8,120.0,Completed,04-01-2024,2024-01-01
36,T036,C016,P014,1,69999.0,Completed,2024-04-03,2024-04-03
37,T037,C017,P006,4,899.0,Completed,2024-04-05,2024-04-05
38,T038,C018,P020,1,1899.0,Completed,04-08-2024,2024-08-08
39,T039,C019,P019,2,1499.0,Completed,2024-04-10,2024-04-10
40,T040,C020,P013,1,5499.0,Completed,2024-04-12,2024-04-12

# Customer data

In [1453]:
Cust_df = pd.read_csv("customers_raw.csv", sep = "|")
Cust_df.shape

(26, 7)

In [1454]:
Cust_df_n =  Cust_df
Cust_df_n.head(10)

,customer_id,first_name,last_name,email,phone,city,registration_date
0,C001,Rahul,Sharma,rahul.sharma@gmail.com,9876543210,Bangalore,2023-01-15
1,C002,Priya,Patel,priya.patel@yahoo.com,+91-9988776655,Mumbai,2023-02-20
2,C003,Amit,Kumar,NaN,9765432109,Delhi,2023-03-10
3,C004,Sneha,Reddy,sneha.reddy@gmail.com,9123456789,Hyderabad,15/04/2023
4,C005,Vikram,Singh,vikram.singh@outlook.com,09988112233,Chennai,2023-05-22
5,C006,Anjali,Mehta,anjali.mehta@gmail.com,9876543210,Bangalore,2023-06-18
6,C007,Ravi,Verma,NaN,+919876501234,Pune,2023-07-25
7,C008,Pooja,Iyer,pooja.iyer@gmail.com,9123456780,Bangalore,08-15-2023
8,C009,Karthik,Nair,karthik.nair@yahoo.com,9988776644,Kochi,2023-09-30
9,C010,Deepa,Gupta,deepa.gupta@gmail.com,09871234567,Delhi,2023-10-12

In [1455]:
Cust_df_n.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        26 non-null     object
 1   first_name         26 non-null     object
 2   last_name          26 non-null     object
 3   email              21 non-null     object
 4   phone              26 non-null     object
 5   city               26 non-null     object
 6   registration_date  26 non-null     object
dtypes: object(7)
memory usage: 1.6+ KB

In [1456]:
# Remove all non-digits, then take the last 10 characters
Cust_df_n['phone#'] = (
    Cust_df_n['phone']
        .str.replace(r'\D', '', regex=True)  # keep only digits
        .str[-10:]                           # take last 10 digits
)

Cust_df_n.head(2)

,customer_id,first_name,last_name,email,phone,city,registration_date,phone#
0,C001,Rahul,Sharma,rahul.sharma@gmail.com,9876543210,Bangalore,2023-01-15,9876543210
1,C002,Priya,Patel,priya.patel@yahoo.com,+91-9988776655,Mumbai,2023-02-20,9988776655

In [1457]:
# Dropping phone column
Cust_df_n = Cust_df_n.drop( columns = ['phone'])

In [1458]:
Cust_df_n.head(5)

,customer_id,first_name,last_name,email,city,registration_date,phone#
0,C001,Rahul,Sharma,rahul.sharma@gmail.com,Bangalore,2023-01-15,9876543210
1,C002,Priya,Patel,priya.patel@yahoo.com,Mumbai,2023-02-20,9988776655
2,C003,Amit,Kumar,NaN,Delhi,2023-03-10,9765432109
3,C004,Sneha,Reddy,sneha.reddy@gmail.com,Hyderabad,15/04/2023,9123456789
4,C005,Vikram,Singh,vikram.singh@outlook.com,Chennai,2023-05-22,9988112233

In [1459]:
# Extract date, year, and month into new columns
Cust_df_n[['Col1', 'Col2', 'Col3']] = Cust_df_n['registration_date'].str.split(r'[-/]', expand=True)


Cust_df_n.head(2)

,customer_id,first_name,last_name,email,city,registration_date,phone#,Col1,Col2,Col3
0,C001,Rahul,Sharma,rahul.sharma@gmail.com,Bangalore,2023-01-15,9876543210,2023,01,15
1,C002,Priya,Patel,priya.patel@yahoo.com,Mumbai,2023-02-20,9988776655,2023,02,20

In [1460]:
Cust_df_n["regn_date"] = Cust_df_n[["Col1","Col2","Col3"]].agg("-".join,axis=1)

Cust_df_n.head(5)

,customer_id,first_name,last_name,email,city,registration_date,phone#,Col1,Col2,Col3,regn_date
0,C001,Rahul,Sharma,rahul.sharma@gmail.com,Bangalore,2023-01-15,9876543210,2023,01,15,2023-01-15
1,C002,Priya,Patel,priya.patel@yahoo.com,Mumbai,2023-02-20,9988776655,2023,02,20,2023-02-20
2,C003,Amit,Kumar,NaN,Delhi,2023-03-10,9765432109,2023,03,10,2023-03-10
3,C004,Sneha,Reddy,sneha.reddy@gmail.com,Hyderabad,15/04/2023,9123456789,15,04,2023,15-04-2023
4,C005,Vikram,Singh,vikram.singh@outlook.com,Chennai,2023-05-22,9988112233,2023,05,22,2023-05-22

In [1461]:

# Ensure numeric comparison works even if Col1/Col3 are strings
Cust_df_n['Col1'] = pd.to_numeric(Cust_df_n['Col1'], errors='coerce')
Cust_df_n['Col2'] = pd.to_numeric(Cust_df_n['Col2'], errors='coerce')
Cust_df_n['Col3'] = pd.to_numeric(Cust_df_n['Col3'], errors='coerce')

# Col4: if Col1 > 1900, take Col1; else take Col3
Cust_df_n['year'] = np.where(Cust_df_n['Col1'] > 1900, Cust_df_n['Col1'], Cust_df_n['Col3'])

Cust_df_n['month'] = np.where(Cust_df_n['Col2'] < 13, Cust_df_n['Col2'], Cust_df_n['Col3'])

Cust_df_n['month'] = np.where(Cust_df_n['month'] > 12, Cust_df_n['Col1'], Cust_df_n['month'])

Cust_df_n['day'] = np.where(Cust_df_n['Col3'] < 1900, Cust_df_n['Col3'], 1900)

Cust_df_n['day1'] = np.where(
    (Cust_df_n['day'] == 1900) & (Cust_df_n['Col1'] > 12),
    Cust_df_n['Col1'],
    Cust_df_n['Col2']
)

Cust_df_n['Day3'] = np.where(Cust_df_n['day'] ==1900, Cust_df_n['day1'], Cust_df_n['day'])

Cust_df_n.head(10)

,customer_id,first_name,last_name,email,city,registration_date,phone#,Col1,Col2,Col3,regn_date,year,month,day,day1,Day3
0,C001,Rahul,Sharma,rahul.sharma@gmail.com,Bangalore,2023-01-15,9876543210,2023,1,15,2023-01-15,2023,1,15,1,15
1,C002,Priya,Patel,priya.patel@yahoo.com,Mumbai,2023-02-20,9988776655,2023,2,20,2023-02-20,2023,2,20,2,20
2,C003,Amit,Kumar,NaN,Delhi,2023-03-10,9765432109,2023,3,10,2023-03-10,2023,3,10,3,10
3,C004,Sneha,Reddy,sneha.reddy@gmail.com,Hyderabad,15/04/2023,9123456789,15,4,2023,15-04-2023,2023,4,1900,15,15
4,C005,Vikram,Singh,vikram.singh@outlook.com,Chennai,2023-05-22,9988112233,2023,5,22,2023-05-22,2023,5,22,5,22
5,C006,Anjali,Mehta,anjali.mehta@gmail.com,Bangalore,2023-06-18,9876543210,2023,6,18,2023-06-18,2023,6,18,6,18
6,C007,Ravi,Verma,NaN,Pune,2023-07-25,9876501234,2023,7,25,2023-07-25,2023,7,25,7,25
7,C008,Pooja,Iyer,pooja.iyer@gmail.com,Bangalore,08-15-2023,9123456780,8,15,2023,08-15-2023,2023,8,1900,15,15
8,C009,Karthik,Nair,karthik.nair@yahoo.com,Kochi,2023-09-30,9988776644,2023,9,30,2023-09-30,2023,9,30,9,30
9,C010,Deepa,Gupta,deepa.gupta@gmail.com,Delhi,2023-10-12,9871234567,2023,10,12,2023-10-12,2023,10,12,10,12

In [1462]:
#Concatnating year date and month coumn to form correct Regn_date column


#Cust_df_n['regn_date_1'] = Cust_df_n[['year', 'month', 'Day3']].astype(str).agg('-'.join, axis=1)


# Ensure values are clean and numeric
Cust_df_n['year'] = pd.to_numeric(Cust_df_n['year'], errors='coerce')
Cust_df_n['month'] = pd.to_numeric(Cust_df_n['month'], errors='coerce')
Cust_df_n['Day3'] = pd.to_numeric(Cust_df_n['Day3'], errors='coerce')

# Create a datetime column
Cust_df_n['regn_date_dt'] = pd.to_datetime(
    dict(year=Cust_df_n['year'], month=Cust_df_n['month'], day=Cust_df_n['Day3']),
    errors='coerce'  # invalid combos become NaT
)


Cust_df_n.head(10)

,customer_id,first_name,last_name,email,city,registration_date,phone#,Col1,Col2,Col3,regn_date,year,month,day,day1,Day3,regn_date_dt
0,C001,Rahul,Sharma,rahul.sharma@gmail.com,Bangalore,2023-01-15,9876543210,2023,1,15,2023-01-15,2023,1,15,1,15,2023-01-15
1,C002,Priya,Patel,priya.patel@yahoo.com,Mumbai,2023-02-20,9988776655,2023,2,20,2023-02-20,2023,2,20,2,20,2023-02-20
2,C003,Amit,Kumar,NaN,Delhi,2023-03-10,9765432109,2023,3,10,2023-03-10,2023,3,10,3,10,2023-03-10
3,C004,Sneha,Reddy,sneha.reddy@gmail.com,Hyderabad,15/04/2023,9123456789,15,4,2023,15-04-2023,2023,4,1900,15,15,2023-04-15
4,C005,Vikram,Singh,vikram.singh@outlook.com,Chennai,2023-05-22,9988112233,2023,5,22,2023-05-22,2023,5,22,5,22,2023-05-22
5,C006,Anjali,Mehta,anjali.mehta@gmail.com,Bangalore,2023-06-18,9876543210,2023,6,18,2023-06-18,2023,6,18,6,18,2023-06-18
6,C007,Ravi,Verma,NaN,Pune,2023-07-25,9876501234,2023,7,25,2023-07-25,2023,7,25,7,25,2023-07-25
7,C008,Pooja,Iyer,pooja.iyer@gmail.com,Bangalore,08-15-2023,9123456780,8,15,2023,08-15-2023,2023,8,1900,15,15,2023-08-15
8,C009,Karthik,Nair,karthik.nair@yahoo.com,Kochi,2023-09-30,9988776644,2023,9,30,2023-09-30,2023,9,30,9,30,2023-09-30
9,C010,Deepa,Gupta,deepa.gupta@gmail.com,Delhi,2023-10-12,9871234567,2023,10,12,2023-10-12,2023,10,12,10,12,2023-10-12

In [1463]:
Cust_df_n.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        26 non-null     object
 1   first_name         26 non-null     object
 2   last_name          26 non-null     object
 3   email              21 non-null     object
 4   city               26 non-null     object
 5   registration_date  26 non-null     object
 6   phone#             26 non-null     object
 7   Col1               26 non-null     int64
 8   Col2               26 non-null     int64
 9   Col3               26 non-null     int64
 10  regn_date          26 non-null     object
 11  year               26 non-null     int64
 12  month              26 non-null     int64
 13  day                26 non-null     int64
 14  day1               26 non-null     int64
 15  Day3               26 non-null     int64
 16  regn_date_dt       26 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(8), object(8)
memory usage: 3.6+ KB

In [1464]:
#taking final columns

Cust_df_n = Cust_df_n.drop(
    ["registration_date", "Col1", "Col2", "Col3", "year", "month", "day", "day1", "Day3","regn_date"],
    axis=1
)

In [1465]:
Cust_df_n.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   26 non-null     object
 1   first_name    26 non-null     object
 2   last_name     26 non-null     object
 3   email         21 non-null     object
 4   city          26 non-null     object
 5   phone#        26 non-null     object
 6   regn_date_dt  26 non-null     datetime64[ns]
dtypes: datetime64[ns](1), object(6)
memory usage: 1.6+ KB

In [1466]:
#checking valid phone no counts using its lenth
# 
Cust_df_n['phone_is_10'] = Cust_df_n['phone#'].str.len() == 10


valid_count = Cust_df_n['phone_is_10'].sum()
invalid_count = (~Cust_df_n['phone_is_10']).sum()
total = len(Cust_df_n)

print(f"Valid (10 digits): {valid_count} / {total}")
print(f"Invalid (not 10 digits): {invalid_count}")

Valid (10 digits): 26 / 26
Invalid (not 10 digits): 0

# Product Data

In [1467]:
Product_df = pd.read_csv("products_raw.csv",sep="|")
Product_df.head()

  product_id        product_name     category    price  stock_quantity
0       P001  Samsung Galaxy S21  Electronics  45999.0           150.0
1       P002  Nike Running Shoes      fashion   3499.0            80.0
2       P003   Apple MacBook Pro  ELECTRONICS      NaN            45.0
3       P004        Levi's Jeans      Fashion   2999.0           120.0
4       P005     Sony Headphones  electronics   1999.0           200.0

In [1468]:
Product_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   product_id      20 non-null     object
 1   product_name    20 non-null     object
 2   category        20 non-null     object
 3   price           17 non-null     float64
 4   stock_quantity  19 non-null     float64
dtypes: float64(2), object(3)
memory usage: 932.0+ bytes

In [1469]:
Product_df_n=Product_df

Product_df_n.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   product_id      20 non-null     object
 1   product_name    20 non-null     object
 2   category        20 non-null     object
 3   price           17 non-null     float64
 4   stock_quantity  19 non-null     float64
dtypes: float64(2), object(3)
memory usage: 932.0+ bytes

In [1470]:
Product_df_n.head()

  product_id        product_name     category    price  stock_quantity
0       P001  Samsung Galaxy S21  Electronics  45999.0           150.0
1       P002  Nike Running Shoes      fashion   3499.0            80.0
2       P003   Apple MacBook Pro  ELECTRONICS      NaN            45.0
3       P004        Levi's Jeans      Fashion   2999.0           120.0
4       P005     Sony Headphones  electronics   1999.0           200.0

In [1471]:
import re
import unicodedata

# -----------------------------
# Helper dictionaries & patterns
# -----------------------------

# Common product noun normalization
PRODUCT_SYNONYMS = {
    r"\b(t[-\s]?shirt|tees?)\b": "tshirt",
    r"\b(track\s?pants?)\b": "trackpants",
    r"\b(head[-\s]?phones)\b": "headphones",
    r"\b(ear[-\s]?buds?)\b": "earbuds",
    r"\b(jeans)\b": "jeans",
    r"\b(sneakers|shoes)\b": "sneakers",
    r"\b(lap[-\s]?top)\b": "laptop",
    r"\b(tv|television)\b": "tv",
    r"\b(monitor)\b": "monitor",
    r"\b(rice)\b": "rice",
    r"\b(almonds)\b": "almonds",
    r"\b(honey)\b": "honey",
    r"\b(shirt)\b": "shirt",
    r"\b(ear phones?)\b": "earphones",
}

# Category normalization
CATEGORY_SYNONYMS = {
    r"^electronics$": "Electronics",
    r"^fashion$": "Fashion",
    r"^groceries$": "Groceries",
}

# Units normalization patterns
INCH_PAT = re.compile(r"(\d+)\s*(in|inch|inches)\b", flags=re.I)
KG_PAT = re.compile(r"(\d+(?:\.\d+)?)\s*(kg|kilograms?)\b", flags=re.I)
G_PAT = re.compile(r"(\d+)\s*(g|grams?)\b", flags=re.I)
ML_PAT = re.compile(r"(\d+)\s*(ml|milliliters?)\b", flags=re.I)

# Known nouns to separate brand from product
KNOWN_NOUNS = [
    "galaxy", "nike", "macbook", "jeans", "headphones", "almonds", "laptop",
    "tshirt", "rice", "nord", "sneakers", "monitor", "tv", "iphone", "honey",
    "shirt", "earbuds", "earphones", "trackpants"
]

# -----------------------------
# Normalization utilities
# -----------------------------

def normalize_unicode(text: str) -> str:
    """Normalize unicode and remove non-printable control chars."""
    if pd.isna(text):
        return text
    # NFKC to normalize width variants; strip control characters
    text = unicodedata.normalize("NFKC", str(text))
    text = re.sub(r"[\u200B-\u200D\uFEFF]", "", text)  # zero-width spaces
    return text

def clean_whitespace(text: str) -> str:
    """Trim and collapse multiple spaces."""
    text = text.strip()
    text = re.sub(r"\s+", " ", text)
    return text

def normalize_units(text: str) -> (str, dict):
    """Standardize units to canonical forms and return extracted attributes."""
    attrs = {}
    # inches
    def _inch_repl(m):
        val = int(m.group(1))
        attrs["size_in"] = val
        return f"{val} in"
    text = INCH_PAT.sub(_inch_repl, text)

    # kg
    def _kg_repl(m):
        val = float(m.group(1))
        attrs["weight_kg"] = val
        return f"{val:g} kg"
    text = KG_PAT.sub(_kg_repl, text)

    # g
    def _g_repl(m):
        val = int(m.group(1))
        attrs["weight_g"] = val
        return f"{val} g"
    text = G_PAT.sub(_g_repl, text)

    # ml
    def _ml_repl(m):
        val = int(m.group(1))
        attrs["volume_ml"] = val
        return f"{val} ml"
    text = ML_PAT.sub(_ml_repl, text)

    # common attached forms: 43inch -> 43 in ; 1kg -> 1 kg ; 500g -> 500 g
    text = re.sub(r"\b(\d+)(inch|inches|in)\b", lambda m: f"{m.group(1)} in", text, flags=re.I)
    text = re.sub(r"\b(\d+(?:\.\d+)?)(kg)\b", lambda m: f"{m.group(1)} kg", text, flags=re.I)
    text = re.sub(r"\b(\d+)(g)\b", lambda m: f"{m.group(1)} g", text, flags=re.I)
    text = re.sub(r"\b(\d+)(ml)\b", lambda m: f"{m.group(1)} ml", text, flags=re.I)
    return text, attrs

def normalize_synonyms(text: str) -> str:
    """Apply product synonym rules (works best on lowercased text)."""
    t = text
    for pat, repl in PRODUCT_SYNONYMS.items():
        t = re.sub(pat, repl, t, flags=re.I)
    return t

def canonical_case(text: str) -> str:
    """Lowercase canonical representation."""
    return text.lower()

def display_case(text: str) -> str:
    """Title-case for display while respecting units and acronyms."""
    # Title-case, then fix 'Tv' -> 'TV', 'In' in units
    t = text.title()
    t = re.sub(r"\bTv\b", "TV", t)
    t = re.sub(r"\bIn\b", "in", t)  # keep unit 'in' lowercase
    return t

def extract_brand_product(canonical_name: str) -> (str, str):
    """
    Naive split: brand is the leading token(s) until a known noun appears.
    e.g., 'samsung galaxy s21' -> brand 'samsung', product 'galaxy s21'
    """
    tokens = canonical_name.split()
    if not tokens:
        return None, canonical_name

    # find first known noun index
    idx = None
    for i, tok in enumerate(tokens):
        if tok in KNOWN_NOUNS:
            idx = i
            break

    if idx is None or idx == 0:
        # brand is the first token if it looks like a brand (capitalized in original)  fallback simple rule
        return tokens[0], " ".join(tokens[1:]) if len(tokens) > 1 else None
    else:
        brand = " ".join(tokens[:idx]) if idx > 0 else None
        product = " ".join(tokens[idx:])
        return brand or None, product or None

def rationalize_name(raw_name: str) -> dict:
    """
    Full pipeline: normalize unicode/whitespace, standardize units,
    harmonize synonyms, produce canonical & display names, and extract brand/product.
    """
    if pd.isna(raw_name) or not str(raw_name).strip():
        return {
            "canonical_name": None,
            "display_name": None,
            "brand": None,
            "product_core": None,
            "size_in": None,
            "weight_g": None,
            "weight_kg": None,
            "volume_ml": None,
        }

    t = normalize_unicode(raw_name)
    t = clean_whitespace(t)

    # Keep punctuation like apostrophes; normalize dashes/underscores to space
    t = re.sub(r"[_|]+", " ", t)
    t = re.sub(r"[-]+", "-", t)  # unify dashes

    # Standardize units and collect attributes
    t, attrs = normalize_units(t)

    # Lowercase for canonical ops, then apply synonyms
    t_lower = canonical_case(t)
    t_lower = normalize_synonyms(t_lower)

    # Remove redundant multiple spaces after substitutions
    t_lower = clean_whitespace(t_lower)

    # Canonical & display
    canonical = t_lower
    display = display_case(canonical)

    # Extract brand & product core (best-effort)
    brand, product_core = extract_brand_product(canonical)

    return {
        "canonical_name": canonical,
        "display_name": display,
        "brand": brand,
        "product_core": product_core,
        "size_in": attrs.get("size_in"),
        "weight_g": attrs.get("weight_g"),
        "weight_kg": attrs.get("weight_kg"),
        "volume_ml": attrs.get("volume_ml"),
    }

def normalize_category(raw_cat: str) -> str:
    if pd.isna(raw_cat):
        return None
    t = normalize_unicode(str(raw_cat))
    t = clean_whitespace(t).lower()
    for pat, repl in CATEGORY_SYNONYMS.items():
        if re.match(pat, t, flags=re.I):
            return repl
    # Title-case fallback
    return t.title()


data = Product_df
df = pd.DataFrame(data)

# Apply rationalization
r_cols = df["product_name"].apply(rationalize_name).apply(pd.Series)
df["canonical_name"] = r_cols["canonical_name"]
df["display_name"] = r_cols["display_name"]
df["brand"] = r_cols["brand"]
df["product_core"] = r_cols["product_core"]
df["size_in"] = r_cols["size_in"]
df["weight_g"] = r_cols["weight_g"]
df["weight_kg"] = r_cols["weight_kg"]
df["volume_ml"] = r_cols["volume_ml"]

# Normalize categories
df["category_normalized"] = df["category"].apply(normalize_category)

# Optional: derive a "rationalized_product_name" you can store back
df["rationalized_product_name"] = df.apply(
    lambda r: r["display_name"], axis=1
)

# Preview
print(df[[
    "product_id", "product_name", "rationalized_product_name",
    "canonical_name", "brand", "product_core",
    "size_in", "weight_g", "weight_kg",
    "category", "category_normalized"
]].to_string(index=False))

Product_df_n_1=df

product_id        product_name rationalized_product_name        canonical_name    brand     product_core  size_in  weight_g  weight_kg    category category_normalized
      P001  Samsung Galaxy S21        Samsung Galaxy S21    samsung galaxy s21  samsung       galaxy s21      NaN       NaN        NaN Electronics         Electronics
      P002  Nike Running Shoes     Nike Running Sneakers nike running sneakers     nike running sneakers      NaN       NaN        NaN     fashion             Fashion
      P003   Apple MacBook Pro         Apple Macbook Pro     apple macbook pro    apple      macbook pro      NaN       NaN        NaN ELECTRONICS         Electronics
      P004        Levi's Jeans              Levi'S Jeans          levi's jeans   levi's            jeans      NaN       NaN        NaN     Fashion             Fashion
      P005     Sony Headphones           Sony Headphones       sony headphones     sony       headphones      NaN       NaN        NaN electronics         Electronics
      P006     Organic Almonds           Organic Almonds       organic almonds  organic          almonds      NaN       NaN        NaN   Groceries           Groceries
      P007           HP Laptop                 Hp Laptop             hp laptop       hp           laptop      NaN       NaN        NaN Electronics         Electronics
      P008      Adidas T-Shirt             Adidas Tshirt         adidas tshirt   adidas           tshirt      NaN       NaN        NaN     FASHION             Fashion
      P009    Basmati Rice 5kg         Basmati Rice 5 Kg     basmati rice 5 kg  basmati        rice 5 kg      NaN       NaN        5.0   groceries           Groceries
      P010        OnePlus Nord              Oneplus Nord          oneplus nord  oneplus             nord      NaN       NaN        NaN Electronics         Electronics
      P011       Puma Sneakers             Puma Sneakers         puma sneakers     puma         sneakers      NaN       NaN        NaN     Fashion             Fashion
      P012 Dell Monitor 24inch        Dell Monitor 24 in    dell monitor 24 in     dell    monitor 24 in     24.0       NaN        NaN Electronics         Electronics
      P013      Woodland Shoes         Woodland Sneakers     woodland sneakers woodland         sneakers      NaN       NaN        NaN     fashion             Fashion
      P014           iPhone 13                 Iphone 13             iphone 13   iphone               13      NaN       NaN        NaN Electronics         Electronics
      P015  Organic Honey 500g       Organic Honey 500 G   organic honey 500 g  organic      honey 500 g      NaN     500.0        NaN   Groceries           Groceries
      P016   Samsung TV 43inch          Samsung TV 43 in      samsung tv 43 in  samsung         tv 43 in     43.0       NaN        NaN ELECTRONICS         Electronics
      P017           H&M Shirt                 H&M Shirt             h&m shirt      h&m            shirt      NaN       NaN        NaN     Fashion             Fashion
      P018      Masoor Dal 1kg           Masoor Dal 1 Kg       masoor dal 1 kg   masoor         dal 1 kg      NaN       NaN        1.0   groceries           Groceries
      P019        Boat Earbuds              Boat Earbuds          boat earbuds     boat          earbuds      NaN       NaN        NaN Electronics         Electronics
      P020   Reebok Trackpants         Reebok Trackpants     reebok trackpants   reebok       trackpants      NaN       NaN        NaN     FASHION             Fashion

In [1472]:
#removing unnecessary columns

Product_df_n_1.drop(columns=['product_name','category','canonical_name','size_in','weight_g','weight_kg','volume_ml'], inplace=True)

In [1473]:
Product_df_n_1.head(10)

,product_id,price,stock_quantity,display_name,brand,product_core,category_normalized,rationalized_product_name
0,P001,45999.0,150.0,Samsung Galaxy S21,samsung,galaxy s21,Electronics,Samsung Galaxy S21
1,P002,3499.0,80.0,Nike Running Sneakers,nike,running sneakers,Fashion,Nike Running Sneakers
2,P003,NaN,45.0,Apple Macbook Pro,apple,macbook pro,Electronics,Apple Macbook Pro
3,P004,2999.0,120.0,Levi'S Jeans,levi's,jeans,Fashion,Levi'S Jeans
4,P005,1999.0,200.0,Sony Headphones,sony,headphones,Electronics,Sony Headphones
5,P006,899.0,NaN,Organic Almonds,organic,almonds,Groceries,Organic Almonds
6,P007,52999.0,60.0,Hp Laptop,hp,laptop,Electronics,Hp Laptop
7,P008,1299.0,150.0,Adidas Tshirt,adidas,tshirt,Fashion,Adidas Tshirt
8,P009,650.0,300.0,Basmati Rice 5 Kg,basmati,rice 5 kg,Groceries,Basmati Rice 5 Kg
9,P010,NaN,95.0,Oneplus Nord,oneplus,nord,Electronics,Oneplus Nord

In [1474]:
Product_df_n_1.head()

,product_id,price,stock_quantity,display_name,brand,product_core,category_normalized,rationalized_product_name
0,P001,45999.0,150.0,Samsung Galaxy S21,samsung,galaxy s21,Electronics,Samsung Galaxy S21
1,P002,3499.0,80.0,Nike Running Sneakers,nike,running sneakers,Fashion,Nike Running Sneakers
2,P003,NaN,45.0,Apple Macbook Pro,apple,macbook pro,Electronics,Apple Macbook Pro
3,P004,2999.0,120.0,Levi'S Jeans,levi's,jeans,Fashion,Levi'S Jeans
4,P005,1999.0,200.0,Sony Headphones,sony,headphones,Electronics,Sony Headphones

In [ ]:

# 1) Identify products with missing price (NaN or 0)
missing_mask = Product_df_n_1['price'].isna() | (Product_df_n_1['price'] == 0)
missing_product_ids = Product_df_n_1.loc[missing_mask, 'product_id'].unique()

# 2) Filter relevant sales rows and keep only those with a unit_price
sales_relevant = Sales_df_n[
    Sales_df_n['product_id'].isin(missing_product_ids) & 
    Sales_df_n['unit_price'].notna()
].copy()

# 3) use the latest unit_price per product_id
if 'sale_date' in sales_relevant.columns:
    # Ensure sale_date is datetime
    sales_relevant['sale_date'] = pd.to_datetime(sales_relevant['sale_date'], errors='coerce')
    # Sort by product_id and sale_date to get most recent
    sales_relevant.sort_values(['product_id', 'sale_date'], inplace=True)
    latest_prices = sales_relevant.dropna(subset=['sale_date']).groupby('product_id').tail(1)
    price_map = latest_prices.set_index('product_id')['unit_price']
else:
    # Fallback: use the median unit_price per product_id (robust against outliers)
    price_map = sales_relevant.groupby('product_id')['unit_price'].median()

# 4) Fill only the missing prices in Products_df_n_1
Product_df_n_1.loc[missing_mask, 'price'] = Product_df_n_1.loc[missing_mask, 'product_id'].map(price_map)

# 5) Optional: report any product_ids still missing (no price found in sales)
still_missing = Product_df_n_1.loc[Product_df_n_1['price'].isna() | (Product_df_n_1['price'] == 0), 'product_id'].unique()
if len(still_missing) > 0:
    print("No unit_price found in sales for these product_id(s):", still_missing)

In [1478]:

Product_df_n_1[
    (Product_df_n_1["product_id"] == "P003") |
    (Product_df_n_1["stock_quantity"] == 45)
]

,product_id,price,stock_quantity,display_name,brand,product_core,category_normalized,rationalized_product_name
2,P003,52999.0,45.0,Apple Macbook Pro,apple,macbook pro,Electronics,Apple Macbook Pro

In [ ]:
Sales_df_n.head()

,transaction_id,customer_id,product_id,quantity,unit_price,status,regn_date,txn_date_dt
0,T001,C001,P001,1,45999.0,Completed,2024-01-15,2024-01-15
1,T002,C002,P004,2,2999.0,Completed,2024-01-16,2024-01-16
2,T003,C003,P007,1,52999.0,Completed,15-01-2024,2024-01-15
4,T005,C005,P009,3,650.0,Completed,2024-01-20,2024-01-20
5,T006,C006,P012,1,12999.0,Completed,01-22-2024,2024-01-22